Repository: Amustache/Projet-Gameplay
Catalog: Webapp/translations/*/LC_MESSAGES/messages.po
Languages: fr

source: Please, upload a video first
fr: Il faut d'abord téléverser une vidéo !

source: The file seems to be invalid
fr: Le fichier sélectionné semble invalide

source: Home
fr: Accueil

source: Recording script
fr: Script pour enregistrement

source: Report
fr: Rapport

source: Online experiment
fr: Expérience en ligne

source: Online experiment - Results
fr: Expérience en ligne - Résultats

source: Previous frame
fr: Frame précédente

source: Next frame
fr: Frame suivante

source: On the left, the first table indicates the prediction for the current frame. If example data are loaded, the ground truth and the total accuracy are also displayed
fr: Sur la gauche, le premier tableau indique la prédiction du la frame actuelle Si des données d'exemple ont été fournies, leur analyse et la précision sont également affichées

source: The second table on the left displays the transitions encountered so far from the first frame of the video. <br> The table should be read from column to line. For exemple, the top right cell indicated the percentage of "x" (jumps) followed by a "Key.right" (movement to the right)
fr: Le deuxième tableau sur la gauche affiche les transitions rencontrées jusqu'à la frame actuelle <br> Le tableau se lit de colonnes en ligne Par exemple, la cellule en haut à droite indique le pourcentage de "x" (sauts) suivis par un "Key.right" (mouvement à droite)

source: The graphic on the right shows the key presses over the next few seconds
fr: Le graphique à droite affiches les touches pressées pour les quelques secondes à venir

source: Time
fr: Temps

source: Keys analysis
fr: Analyse des boutons

source: Smoothing
fr: Lissage

source: Game Loop Analysis
fr: Analyse de game loop

source: Our game loop extraction currently works as follow :
fr: Notre algorithme d'extraction de game loop fonctionne de la manière suivante :

source: The list of all key presses is extracted from the video using our machine learning model
fr: La liste de toutes les touches pressés est extraite de la video en utilisant notrealgorithme de machine learning

source: This list is parsed using <a href="https://en.wikipedia.org/wiki/Byte_pair_encoding">Byte Pair Encoding</a> with the number of iterations given below. The result is a new list were the most recurring patterns are considered states themselves.
fr: Cette liste est traitée à l'aide du <a href="https://en.wikipedia.org/wiki/Byte_pair_encoding">Byte Pair Encoding</a> avec le nombre d'itérations indiquées ci-dessous. Le résultat est une nouvelle liste où les transitions les plus récurrentes sont considérées en tant que nouvel état.

source: From this new list the table of transitions is extracted (available in the "details" section below)
fr: De cette nouvelle liste est extraite le tableau des transitions (se trouvant dans la section "Détails" ci-dessous)

source: The loops found in the transition table with the highest probabilities are extracted. The probability is computed using a heuristic taking as parameter the probability of transition and the number of states in the loop.
fr: Les boucles trouvées dans le tableau de transitions avec les plus grandes probabilités sont extraites. La probabilité est est calculée à l'aide d'une heuristique prenant en paramètre la probabilité de transition et le nombre d'états d'une boucle.

source: Number of iterations
fr: Nombre d'itérations

source: Number of loops shown
fr: Nombre de boucles affichées

source: Execute algorithm
fr: Executer l'algorithme

source: Loops
fr: Boucles

source: List of loops. <br> A black arrow indicates a transition extracted from the <a href="https://en.wikipedia.org/wiki/Byte_pair_encoding">Byte Pair Encoding</a>. <br> A red arrow indicates a transition from two Byte Pair Encoding states. The last red arrow indicates a loop to the first state.
fr: List des boucles trouvées. <br> Une flèche noire indique une transition issu du <a href="https://en.wikipedia.org/wiki/Byte_pair_encoding">Byte Pair Encoding</a>. <br> Une flèche rouge indique une transition entre deux états du Byte Pair Encoding. La dernière flèche rouge d'une ligne indique un retour au premier état.

source: The detailed table of transitions and the states extracted using the Byte Pair Encoding can be found in the "details" section below
fr: Le tableau détaillé des transitions et les états extraits à l'aide duByte Pair Encoding peuvent être trouvés dans la section "Détails" ci-dessous

source: The transition table extracted using Byte Pair Encoding. The number in the first row and column corresponds to the states in the second table below
fr: Le tableau des transitions extrait en utilisant le Byte Pair Encoding.les nombres de la première ligne et de la première colonne correspondent aux états dans le second tableau ci-dessous

source: General information
fr: Informations générales

source: This page runs a deep learning model that recognizes the key logs from a short clip of a Super Mario Bros video
fr: Cette page utilise un modèle de deep learning pour extraire les entréesd'un court extrait de Super Mario Bros

source: We are currently working on improving the model, right now it has the following limitations :
fr: Nous travaillons pour améliorer le modèle. Actuellement les limitationssont les suivantes :

source: The video should be a fullscreen recording (no frame around the game itself)
fr: La vidéo doit être pleine écran (pas d'incrustation autour du jeu)

source: The ratio should be the same as the original game (black borders are fine, but the original game should not be stretched)
fr: Le ratio d'écran doit être le même que le jeu original (pas de déformation) ,les bordures sont autorisées

source: The run button is not recognized
fr: Le bouton de course n'est pour le moment pas reconnu

source: For computational reasons, only the first 13 first minutes will be processed if the video contains more
fr: Pour des raisons de temps de calcul, seules les 13 premières minutesseront traitées

source: The video must be in .MP4 format
fr: La vidéo doit être en format MP4

source: Experiment with input prediction in a chosen game !
fr: Expérimentez vous-même la prédiction des inputs dans le jeu de votre choix !

source: Upload a video you wish to process, then press "Send"
fr: Téléchargez la vidéo que vous souhaitez traiter, puis appuyez sur "Envoyer"

source: Send
fr: Envoyer

source: ... You can also use the data provided here.
fr: … Vous pouvez également utiliser les données fournies en exemple.

source: If you do not wish to provide you own video, you can use our example data. <br> This example video comes with the truth key logs to assess the model's performance.
fr: Si vous ne souhaitez pas fournir votre propre vidéo, vous pouvez utiliser nos données d'exemple. <br> Cet exemple est fournis avec les véritables entrées pour calculer la performance du modèle.

source: Use example data
fr: Utiliser les données d'exemple

source: You can use gameplay videos on YouTube for the experience. These videos must respect the same constraints mentioned above.
fr: Il est possible d'utiliser des vidéos YouTube pour l'expérience. Ces vidéosdoivent respecter les mêmes contraintes décrites ci-dessus

source: Gameplay Analysis and Preservation
fr: Analyse et préservation de Gameplay

source: This project aims at extracting gameplay data from game recordings.
fr: Ce projet vise à extraire les données de gameplay à partir d'enregistrements

source: The goals of this project are :
fr: Les objectifs de ce projet sont :

source: Read the report
fr: Lire le rapport

source: Try the experiment
fr: Réaliser l'expérience

source: Server overloaded
fr: Serveur surchargé

source: To collect data from various games, we used the free and open source software <a href="https://obsproject.com/">OBS</a>
fr: Pour collecter les données des différents jeux, nous avons utilisé le logiciel libre et gratuit <a href="https://obsproject.com/">OBS</a>

source: As to gather input data, we developed a plugin that records all the key pressed on the keyboard during the record time.
fr: Pour recueillir les données d'entrée, nous avons développé un plugin qui enregistre toutes les touches pressées sur le clavier pendant la durée de l'enregistrement.

source: Setup and requirements
fr: Installation et dépendances

source: The script has the following dependencies :
fr: Le script possèdes les dépendances suivantes :

source: <a href="https://www.python.org/">Python 3</a> should be installed
fr: <a href="https://www.python.org/">Python 3</a> doit être installé

source: <a href="https://pypi.org/project/pynput/">pynput</a> should be installed <br> Using pip the command is <code>pip install pynput</code>
fr: <a href="https://pypi.org/project/pynput/">pynput</a> doit être installé <br> La commande pip est la suivante : <code>pip install pynput</code>

source: Download
fr: Téléchargement

source: The script can be downloaded by clicking <a href="/static/obs/script.py"><b>here</b></a>
fr: Le script peut être téléchargé en utilisant le lien suivant : <a href="/static/obs/script.py"><b>ici</b></a>

source: The plugin can be installed like any other OBS script
fr: Le plugin peut être installé comme tout autre script OBS

source: In the new window, locate the downloaded script by clicking on the "+" button
fr: Dans la nouvelle fenêtre, indiquer le script téléchargé, et cliquer sur le bouton "+"

source: Once the script is loaded, the configuration appears on the right. The path where the key logs will be stored can be configured
fr: Une fois le script chargé, sa configuration apparaît sur la droite. Le cheminoù les entrées doivent être enregistrées peut être configuré.

source: The key log will automatically start and stop with the recording of a video
fr: L'enregistrement des entrées commencera et s'arrêtera automatiquementen même temps que la vidéo

source: Screenshot of the script menu in OBS and the script configuration
fr: Capture d'écran de la fenêtre des scripts d'OBS avec leur configuration

source: Output format
fr: Format de sortie

source: The output is a .<abbr title="comma separated values">csv</abbr> file. <br> The header always contains <code>FRAME,KEY,STATUS</code>, then each line describes a key event. Each line contains the frame at which the event happens, the key that changed and its new state.
fr: Le format de sortie est un fichier .<abbr title="comma separated values">csv</abbr>. <br> L'en-tête contiens <code>FRAME,KEY,STATUS</code>, puis chaque line décrit la pression d'une touche. Chaque ligne contient la frame durant laquelle l'événement est survenu, la touche concernée et son nouvel état (enfoncé/relâché).

source: This format has the following properties :
fr: Ce format a les propriétés suivantes :

source: A line is added only when an event occurs, so many frame does not have an entry in the file. This reduces the log size.
fr: Une ligne n'est ajoutée que lorsqu'un événement survient, et non a chaque frame.Cela produit un fichier plus compacte.

source: Multiple event (key state changes) may occur on the same frame. Thus, multiple lines can have the same <code>FRAME</code> number
fr: Plusieurs événements peuvent survenir lors de la même frame, puisque plusieurslignes peuvent indiquer la même frame.

source: The lines are sorted by <code>FRAME</code>
fr: Les lignes sont triées par ordre de frame croissant

source: Loading
fr: Chargement
